#include <iostream>
#include <io.h>
#include <fcntl.h>

using namespace std;

int main()
{
	int previewMode = _setmode(_fileno(stdout), _O_U16TEXT);

	wcout << L" ██████╗  █████╗ ███╗   ███╗███████╗     ██████╗ ██╗   ██╗███████╗██████╗  \n";
	wcout << L"██╔════╝ ██╔══██╗████╗ ████║██╔════╝    ██╔═══██╗██║   ██║██╔════╝██╔══██╗ \n";
	wcout << L"██║  ███╗███████║██╔████╔██║█████╗      ██║   ██║██║   ██║█████╗  ██████╔╝ \n";
	wcout << L"██║   ██║██╔══██║██║╚██╔╝██║██╔══╝      ██║   ██║╚██╗ ██╔╝██╔══╝  ██╔══██╗ \n";
	wcout << L"╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗    ╚██████╔╝ ╚████╔╝ ███████╗██║  ██║ \n";
	wcout << L" ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝     ╚═════╝   ╚═══╝  ╚══════╝╚═╝  ╚═╝ \n";

	_setmode(_fileno(stdout), previewMode);
	cout << "안녕하세요";

                                                                                                                                                                                                                


	return 0;
}